---
本文作者FangziOMG，未经作者允许不得以任何方式转载
---

# 会用即强大
    
   ——房子OMG
   
不管怎么样，请您安静的看到最后。

说来也是话长，之前我的同学杨某人被他课外班认识的人拉进了一个微信群，这个群在他进入时名字叫“技术宅的技术栈”想必各位一听到这个名字就会觉得这一定是个技术宅聚集地，不过也确实是这样。这个群里的人大多初一学生，喜欢鼓捣一些技术方面的东西。可是最近疫情期间他们又心血来潮，要写个Python（编程语言）的教程，结果这杨某人倒是一下就想到我了，可能是附近只有我是文章和Python都写的能让别人看得下去的人选吧……毕竟技术类文章这两种能力缺一不可。
但是我们今天要讲的并不是我们到底写了什么的内容，而是到底借助什么来写的，就像即使你再聪明考试没带笔智商也白搭，对吧。所以我们前后因为需要收费从gitbook这个简洁好用的网站搬到了全球程序员社区GitHub，毕竟别的真的找不到好的了。不过迁移了这问题也来了，因为gitbookPDF生成的问题，把原来我们好端端的中文标题全给改成拼音了，这怎么看？其实最主要原因在于GitHubCEO竟然没有去添加一项可以在线删除和更改名称的按键……而且唯一会改的队长Andy最近学业繁忙根本没时间上线群聊，就只能自己动手了。

百度搜索框里输入“如何远程删除GitHub文件”有用的结果却寥寥无几，内心随时处在绝望的状态，如果耗时很长时间，但一看进程百分之零，这种感觉是很煎熬的。不过我有耐心点击了“下一页”按钮，总算找到一篇有用的教程，我也第一次接触了这个强大的分布式项目版本控制系统——GIT。


由jetbrains开发的intellIJ（下文简称IJ）内置了一个GIT功能，只要把我们在GitHub的网址填进对话框便可以完成在线仓库的同步，这可以说是一项让人看了直称“妙啊”的设计。但是让一个从来没有听说过GIT的人来现场学习这项系统，可能并不能做到成效明显。

试图参考了很多文献后，使用Mac操作系统的我只能使用终端进行操作，GIT在Mac中的安装方式需要通过一条终端指令在线下载，然后指令和网址结合输入到终端中把仓库克隆一份到本地进行编辑。IJ由于是外国公司开发的编译器，并且我没有安装中文翻译包，所以一些简化了的选项晦涩难懂，操作起来非常蹩脚。但是“毕竟都完成一半了，何必不继续做下去呢”的念头促使我继续把它完成。IJ里内置的一个terminal终端可谓是我焦急时刻的“救命稻草”。没有它我无法完成这项工作

之前我已经要崩溃了，因为我反复按了同步键并写了更改原因“删掉一个多余的”，可是再刷新网站啥也没变。我只好在IJ里输入了之前以为与同步键起一样作用的提交更改的指令，令我惊奇的是，原本一次次出现的“unknown command未知指令”终于消失，与其替代的是

“请输入您在网址的用户名：

请输入您在网址的密码：

写入对象中100%（3/3），338字节，完成.”
  
  打开GitHub，搜索Techstack-studios，找到Python-Guide项目，master分支，更改记录：

执行操作：删除，详细内容：“删掉一个多余的”

我才明白，原来之前点的提交只是更新本地仓库，并没有同步到网站上去。

成功了，一切看起来都这么顺利。

但其实背后的工作一点也不顺利。

就是开心，无法形容的开心，也许只有这个词能描述了。

这件事听起来也许很微不足道，毕竟仅仅只是删除一个文件的操作，有些人可能觉得很简单，可是确实很简单，拿给别人一些人肯定会说：“这都什么啊，太麻烦了，不弄。”为什么觉得麻烦？因为不会。但要想会，如果我来教别人一定比我自己学的时候要简单得多。之所以不想弄，是因为这项技术不像玩玩具一样简单易上手。所以如果别人不想学会，这东西在他手里就白搭，如果他想学会，它就会成为他手中的一项强大的工具。所以我懂得了永远不要吝啬于耗出时间来学习一项技术，因为所有能力的学习都是有门槛的，如果简单到所有人动两根手指就会用的话，这项能力本身的作用可能也就不是很大。

记住，这项技术叫GIT，强大的项目版本管理系统，如果想学，还不晚，如果不想学，就请注重于您真正感兴趣的东西，毕竟兴趣是最好的老师。

总结起来一句话：“会用即强大”。

我是房子，一名12岁的编程爱好者。